#include <stdio.h>
#include <stdlib.h>
#include <ctime>
#define K 6
#define N 5

int main()
{
    srand(time(0));
    int A[K][N], a[11] = { 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0 }, n = 0, b = 1, m[4] = { 1, 1, 1, 1 }, c = 1, j = 1, h = 1, k = 1, d = 1, sum[N] = { 0 }, max[K] = { 0 }, min[6], max_k[3] = { 0 }, max2_4k[3] = { 1 }, sum_k[6] = { 0 };
    printf("\nКандидати:     ");
    for (int i = 1; i <= N; i++) {
        printf("  %7d", i);
    }
    printf("\n\n");
    for (int i = 0; i < K; i++) {
        printf("%d населений пункт :", d);
        for (int j = 0; j < N; j++) {
            A[i][j] = rand() % 10 * 10 + 50;
            printf("%8d", A[i][j]);
            sum[j] += A[i][j];
            sum_k[i] += A[i][j];

        }
        d += 1;
        printf("\n\n");
    }
    for (int i = 0; i < K; i++) {
        for (int j = 0; j < N; j++) {
            if (i == 3) {
                max[3] = A[3][0];
                min[0] = A[3][0];
                for (int l = 0; l < N; l++) {
                    if (max[3] < A[3][l]) {
                        max[3] = A[3][l];
                        a[0] = l + 1;
                    }
                    if (min[0] > A[3][l]) {
                        min[0] = A[3][l];
                        a[1] = l + 1;
                    }
                }
            }
            if (i == 0) {
                max[5] = A[0][0];
                min[2] = A[0][0];
                for (int l = 0; l < N; l++) {
                    if (max[5] < A[0][l]) {
                        max[5] = A[0][l];
                        a[6] = l + 1;
                    }
                    if (min[2] > A[3][l]) {
                        min[2] = A[3][l];
                        a[7] = l + 1;
                    }
                }
            }
            if (i == 1 || i == 2) {
                for (int l = 0; l < N; l++) {
                    if (max[1] < A[1][l]) {
                        max[1] = A[1][l];
                        a[2] = l + 1;
                    }
                    if (max[2] < A[2][l]) {
                        max[2] = A[2][l];
                        a[3] = l + 1;
                    }
                }
            }
            if (j == 0) {
                min[1] = A[0][0];
                max[4] = A[0][0];
                for (int l = 0; l < N; l++) {
                    if (max[3] < A[l][0]) {
                        max[3] = A[l][0];
                        a[4] = l + 1;
                    }
                    if (min[1] > A[l][0]) {
                        min[1] = A[l][0];
                        a[5] = l + 1;
                    }
                }
            }
        }
    }
    a[8] = 0;
    a[9] = 0;
    for (int i = 0; i < K; i++) {
        for (int j = 0; j < N; j++) {
            if (j == 0) {
                if (A[i][0] > 100) {
                    a[8] += 1;
                }
            }

            if (j == 4) {
                if (A[i][4] > 100) {
                    a[9] += 1;
                }
            }
        }
    }
    for (int i = 0; i < K; i++) {
        for (int j = 0; j < N; j++) {
            if (j == 0) {
                if (max_k[0] < A[i][0]) {
                    max_k[0] = A[i][0];
                    max2_4k[0] = i + 1;
                }
            }
            if (j == 1) {
                if (max_k[1] < A[i][1]) {
                    max_k[1] = A[i][1];
                    max2_4k[1] = i + 1;
                }
            }
            if (j == 3) {
                if (max_k[2] < A[i][3]) {
                    max_k[2] = A[i][3];
                    max2_4k[2] = i + 1;
                }
            }
        }
    }
        printf("\nСума голосів від одного до п'ятого кандидата : \n");
    for (int i = 0; i < N; i++) {
        printf("%6d", sum[i]);
    }
    printf("\n");
    printf("\nВ 4 населеному пункті %d кандидат набрав найбільше голосів, а %d кандидат набрав найменшу кількість голосів\n", a[0], a[1]);
    printf("\nСума першого кадидата : %d\nСума третього кадидата : %d\n", sum[0], sum[2]);
    printf("\nМаксимальну кількість голосів 2 кандидат набрав в %d населеному пункті, а 4 кандидат набрав в %d населеному пункті\n", max2_4k[1], max2_4k[2]);
    printf("\nСума голосів в кожному населеному пункті :\n");
    for (int i = 0; i < K; i++) {
        printf("%6d", sum_k[i]);
        max[1] = sum_k[0];
    }
    max[0] = sum[0];
    printf("\n");
    for (int i = 1; i < N; i++) {
        if (max[0] < sum[i]) {
            max[0] = sum[i];
            k = i + 1;
        }
    }
    printf("\nЗ всіх кандидатів %d-ий має найбільший рейтинг\n", k);
    printf("\nНайбільше всього голосів 1-ий кадидат набрав в %d населеному пункті\n", max2_4k[0]);
    for (int i = 1; i < K; i++) {
        if (max[1] < sum_k[i]) {
            max[1] = sum_k[i];
            c = i + 1;
        }
    }
    printf("\nУ %d населеному пункті найбільше всього голосів\n", c);
    printf("\nВ 2 населеному пункті %d кандидат набрав найбільше голосів, а в 3 населеному пункті %d кандидат набрав найбільше голосів\n", a[2], a[3]);
    printf("\nНайбільше всього голосів 1 кандидат має в %d населеному пункті, а найменше всього голосів має в %d населеному пункті\n", a[4], a[5]);
    max[1] = sum[1];
    for (int i = 0; i < N; i++) {
        if (i == 1 || i == 3 || i == 4) {
            if (max[1] <= sum[i]) {
                max[1] = sum[i];
                a[5] = i + 1;
            }
        }
    }
    printf("\nСеред другого, четвертого і п’ятого кандидатів найвищий рейтинг у %d кандидата \n", a[5]);
    printf("\nВ 1 населеному пункті %d кандидат набрав найбільше голосів, а %d кандидат набрав найменшу кількість голосів\n", a[6], a[7]);
    printf("\n1 кандидат набрав 100 і більше голосів в %d-ьох населених пунктів, а 5 кандидат набрав 100 і більше голосів в %d-ьох населених пунктів\n", a[8], a[9]);
    printf("\nНаселені пункти у який менше 450 голосів :");
    for (int i = 0; i < K; i++) {
        if (sum_k[i] < 450) {
            printf("%3d,", i + 1);
            n += 1;
            printf("\n");
        }
    }
    if (n == 0) printf(" ніде\n");
    printf("\nМінімальна кількість голосів у кожному населеному пункті : \n");
    a[10] = 1;
    for (int i = 0; i < K; i++) {
        min[3] = A[i][0];
        for (int j = 0; j < N; j++) {
            if (min[3] > A[i][j]) {
                min[3] = A[i][j];
                a[10] = j + 1;
            }
        }
        printf("У %d населеному пункті у %d кандидата найменше голосів\n", i + 1, a[10]);
        a[10] = 0;
    }

    for (int i = 0; i < K; i++) {
        min[4] = A[i][0];
        max[4] = A[i][0];

        for (int j = 0; j < N; j++) {
            if (i == 1) {
                if (min[4] > A[1][j]) {
                    min[4] = A[1][j];
                    m[0] = j + 1;
                }
                if (max[4] < A[1][j]) {
                    max[4] = A[1][j];
                    m[1] = j + 1;
                }

            }
            if (i == 4) {
                if (min[4] > A[4][j]) {
                    min[4] = A[4][j];
                    m[2] = j + 1;
                }
                if (max[4] < A[4][j]) {
                    max[4] = A[4][j];
                    m[3] = j + 1;
                }
            }
        }
    }
    printf("\nВ 2 населеному пункті %d кандидат набрав найбільше голосів, а %d кандидат набрав найменшу кількість голосів", m[1], m[0]);
    printf("\nВ 4 населеному пункті %d кандидат набрав найбільше голосів, а %d кандидат набрав найменшу кількість голосів\n", m[3], m[2]);
return 0;
}